In [52]:
import csv 
import MySQLdb
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String
import random
import numpy as np

In [39]:
#creating mySQL database 
mydb = MySQLdb.connect(host='localhost', user='root', passwd='123456', db='mydb')
cursor = mydb.cursor()

In [40]:
#connecting to database server
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:123456@localhost/mydb', pool_size=25, max_overflow=10, pool_timeout=60,pool_recycle=3600) 
Base = declarative_base()

## Creating a pipeline for storing GTFS data in MySQL database 

Downloading the data from the URL

In [16]:
#Provinding the URL for downloading data 

#For GTFS data 


#For ridership data 

#storing data in the repository

Working from the downloaded data

In [20]:
#Creating a list of standard txt files in the GTFS data
req = ['agency.txt','stops.txt','routes.txt','stop_times.txt','trips.txt']

#Creating a list of mandatory field names in GTFS txt files 
standard_stops = ['stop_id','stop_name','stop_lat','stop_lon','zone_id','parent_station']
standard_agency = ['agency_id', 'agency_name', 'agency_url', 'agency_timezone']
standard_routes = ['route_id', 'agency_id', 'route_short_name', 'route_long_name']
standard_stop_times = ['trip_id', 'arrival_time', 'departure_time', 'stop_id','stop_sequence']
standard_trips = ['route_id', 'service_id','trip_id','direction_id']

Creating a funtion to store the GTFS txt files as table in MySQL database

In [157]:
#creating a data selecter fuction to extract mandatory columns from txt files  
def data_selec(index):
    p = req[index].split(".")[0]
    r = "standard_" + p
    return pd.read_csv(req[index], low_memory = False)[globals()[r]]

#Convert csv to SQL table and store them in database 
for i in range(len(req)):
    globals()[req[i].split(".")[0]] = data_selec(i)
    if i > 0:
        p = globals()[req[i].split(".")[0]]
        q = agency["agency_name"][0].lower() + '_' + req[i].split(".")[0]
        p.to_sql(q, con=engine, if_exists='replace', chunksize=25000)

Storing rider data in the database

In [21]:
#storing the rider data
mbta_rider = pd.read_csv("Line,_and_Stop.csv", low_memory = False)
key_routes = ['1', '15', '22', '23', '28', '32', '39', '57', '66', '71', '73', '77', '111', '116', '117']
mbta_rider = mbta_rider[(mbta_rider["route_id"].isin(key_routes)) & (mbta_rider["season"] == "Fall 2019")]

mbta_rider.to_sql('mbta_rider', con=engine, if_exists='replace', chunksize=25000)

In [25]:
mbta_rider[mbta_rider["route_id"] == "1"]

,FID,season,route_id,route_variant,direction_id,trip_start_time,day_type_id,day_type_name,stop_name,stop_id,stop_sequence,boardings,alightings,load_,sample_size
2588455,2588456,Fall 2019,1,1-_-0,0,04:37:00,day_type_01,weekday,MASSACHUSETTS AVE @ TROWBRIDG,108,23,0.0,1.1,4.6,65
2588459,2588460,Fall 2019,1,1-_-0,0,04:52:00,day_type_01,weekday,MASSACHUSETTS AVE @ TROWBRIDG,108,23,0.4,0.0,3.4,64
2588462,2588463,Fall 2019,1,1-_-0,0,04:37:00,day_type_01,weekday,MASSACHUSETTS AVE @ BOW ST,109,24,0.0,0.4,4.2,65
2588466,2588467,Fall 2019,1,1-_-0,0,04:52:00,day_type_01,weekday,MASSACHUSETTS AVE @ BOW ST,109,24,0.0,0.0,3.4,64
2588467,2588468,Fall 2019,1,1-_-0,0,04:52:00,day_type_01,weekday,MASSACHUSETTS AVE @ HOLYOKE S,110,25,0.0,3.0,0.4,64
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2605115,2605116,Fall 2019,1,1-_-1,1,24:52:00,day_type_01,weekday,84 MASSACHUSETTS AVE,75,13,0.6,0.1,3.8,59
2605116,2605117,Fall 2019,1,1-_-1,1,24:52:00,day_type_01,weekday,MASSACHUSETTS AVE @ MARLBOROU,77,14,0.1,0.5,3.4,59
2605117,2605118,Fall 2019,1,1-_-1,1,24:52:00,day_type_01,weekday,MASSACHUSETTS AVE @ NEWBURY S,79,15,0.6,0.5,3.5,59
2605118,2605119,Fall 2019,1,1-_-1,1,24:52:00,day_type_01,weekday,MASSACHUSETTS AVE OPP CHRISTI,80,16,0.2,0.3,3.5,59
2605119,2605120,Fall 2019,1,1-_-1,1,24:52:00,day_type_01,weekday,MASSACHUSETTS AVE @ HUNTINGTO,82,17,0.3,0.2,3.6,59

1. Joining stoptimes.txt, stops.txt, and trips.txt based on stop id and trip id to make a common dataset

In [5]:
#Import stop time data
query = "SELECT * FROM mbta_stop_times ;"
stop_times= pd.read_sql(query, engine)
stop_times.trip_id=stop_times.trip_id.astype("str")
stop_times.head()

   index   trip_id arrival_time departure_time stop_id  stop_sequence
0      0  42509838     24:30:00       24:30:00   70036              1
1      1  42509838     24:32:00       24:32:00   70034             10
2      2  42509838     24:35:00       24:35:00   70032             20
3      3  42509838     24:37:00       24:37:00   70278             30
4      4  42509838     24:40:00       24:40:00   70030             40

In [6]:
#Import stops data
query = "SELECT * FROM mbta_stops ;"
stops= pd.read_sql(query, engine)
stops=stops[["stop_id","stop_lat","stop_lon"]]
stops.head()

  stop_id   stop_lat   stop_lon
0       1  42.330957 -71.082754
1      10  42.330555 -71.068787
2   10000  42.355692 -71.062911
3   10003  42.331591 -71.076237
4   10005  42.335017 -71.071280

In [41]:
query = "SELECT * FROM mbta_stop_times RIGHT JOIN mbta_stops ON mbta_stops.stop_id = mbta_stop_times.stop_id LEFT JOIN mbta_trips ON mbta_stop_times.trip_id = mbta_trips.trip_id;"
data = pd.read_sql(query, engine).drop(columns = "index")
data = data.loc[:,~data.columns.duplicated()]
data.head()

,trip_id,arrival_time,departure_time,stop_id,stop_sequence,stop_name,stop_lat,stop_lon,zone_id,parent_station,route_id,service_id,direction_id
0,42816380,04:58:00,04:58:00,45332,6.0,Pleasant St @ Vista St,42.42555,-71.085803,None,None,101,WinterWeekday,1.0
1,42816381,05:47:00,05:47:00,45332,6.0,Pleasant St @ Vista St,42.42555,-71.085803,None,None,101,WinterWeekday,1.0
2,42816382,06:02:00,06:02:00,45332,6.0,Pleasant St @ Vista St,42.42555,-71.085803,None,None,101,WinterWeekday,1.0
3,42816383,06:18:00,06:18:00,45332,6.0,Pleasant St @ Vista St,42.42555,-71.085803,None,None,101,WinterWeekday,1.0
4,42816384,06:33:00,06:33:00,45332,6.0,Pleasant St @ Vista St,42.42555,-71.085803,None,None,101,WinterWeekday,1.0

2. Use Google elevation API to add elevation to the existing dataset

In [ ]:
#adding elevation data 
key_stops = list(df["stop_id"].unique())
elevation = []

#making the api request for stops on key bus routes in boston
for i in key_stops:
    lat, long  = stops.loc[stops['stop_id'] == i ,'stop_lat'].iloc[0], stops.loc[stops['stop_id'] == i ,'stop_lon'].iloc[0]
    request=urllib.request.Request('https://maps.googleapis.com/maps/api/elevation/json?locations=' + str(lat)+ ',' + str(long)+ '&key=AIzaSyAFxvY5FVBoueCB1eNxEz42D8CiiaTYZ2A')
    response = urllib.request.urlopen(request)
    elevations = response.read()
    data = json.loads(elevations)
    elevation.append(data["results"][0]["elevation"])

#storing elevation data in a separate table in the database 
elv = pd.DataFrame(list(zip(key_stops, elevation)), columns =['stop_id', 'elevation'])
elv.to_sql('mbta_elevation',con=engine, index = False, if_exists = 'replace')

3. Selecting the key bus routes for analysis

In [42]:
key_routes = ['1', '15', '22', '23', '28', '32', '39', '57', '66', '71', '73', '77', '111', '116', '117']

In [28]:
#taking only key bus routes for boston 

city = {"City": "Boston", "route_id": key_routes}
ab = pd.DataFrame(data = city)
ab.to_sql("cities", con=engine, index = False, if_exists = "replace")

In [43]:

df = data[data["route_id"].isin(key_routes)]

#removing duplicate columns (stop_id ) due to joining 
df = df.loc[:,~df.columns.duplicated()]
df.head()

,trip_id,arrival_time,departure_time,stop_id,stop_sequence,stop_name,stop_lat,stop_lon,zone_id,parent_station,route_id,service_id,direction_id
277,42837102,04:55:00,04:55:00,101,18.0,Massachusetts Ave @ Sidney St,42.362988,-71.099486,None,None,1,WinterSaturday,0.0
278,42837104,05:51:00,05:51:00,101,18.0,Massachusetts Ave @ Sidney St,42.362988,-71.099486,None,None,1,WinterSaturday,0.0
279,42837106,06:56:00,06:56:00,101,18.0,Massachusetts Ave @ Sidney St,42.362988,-71.099486,None,None,1,WinterSaturday,0.0
280,42837108,08:10:00,08:10:00,101,18.0,Massachusetts Ave @ Sidney St,42.362988,-71.099486,None,None,1,WinterSaturday,0.0
281,42837110,09:22:00,09:22:00,101,18.0,Massachusetts Ave @ Sidney St,42.362988,-71.099486,None,None,1,WinterSaturday,0.0

In [44]:
#join the elevation table to previous dataset based on stop id 
query = "SELECT * FROM mbta_elevation;"
elv = pd.read_sql(query, engine, index_col= None)
df=df.merge(elv,left_on="stop_id",right_on="stop_id")
df.head()

,trip_id,arrival_time,departure_time,stop_id,stop_sequence,stop_name,stop_lat,stop_lon,zone_id,parent_station,route_id,service_id,direction_id,elevation
0,42837102,04:55:00,04:55:00,101,18.0,Massachusetts Ave @ Sidney St,42.362988,-71.099486,None,None,1,WinterSaturday,0.0,2.080038
1,42837104,05:51:00,05:51:00,101,18.0,Massachusetts Ave @ Sidney St,42.362988,-71.099486,None,None,1,WinterSaturday,0.0,2.080038
2,42837106,06:56:00,06:56:00,101,18.0,Massachusetts Ave @ Sidney St,42.362988,-71.099486,None,None,1,WinterSaturday,0.0,2.080038
3,42837108,08:10:00,08:10:00,101,18.0,Massachusetts Ave @ Sidney St,42.362988,-71.099486,None,None,1,WinterSaturday,0.0,2.080038
4,42837110,09:22:00,09:22:00,101,18.0,Massachusetts Ave @ Sidney St,42.362988,-71.099486,None,None,1,WinterSaturday,0.0,2.080038

In [ ]:
#storing the final dataset in the database 
engine.execute('SET SESSION MAX_EXECUTION_TIME=2000000000 ;')

#engine.execute('SET GLOBAL net_connect_timeout= 28800;')
df.to_sql('mbta_dataf', con=engine, chunksize = 25000, if_exists ="replace")

4. Creating route data for selected routes consisting of energy consumption, route length, fuel economy and trip count

In [47]:
# making dataframe consisting of route data such as route length, number of trips,energy consumption, fuel economy 
MBTA_energy_30ft = [random.uniform(1.2, 2) for i in range (0,15)]
MBTA_energy_40ft = [random.uniform(1.5, 2) for i in range (0,15)]
MBTA_energy_60ft = [random.uniform(2, 3) for i in range (0,15)]
route_length = [random.uniform(1, 20) for i in range (0,15)]
avg_speed = [random.uniform(2, 4) for i in range (0,15)]
trip_count = [len(df[df["route_id"] == i]["trip_id"].unique()) for i in key_routes]
trip_data = pd.DataFrame(list(zip(key_routes, trip_count,MBTA_energy_30ft,MBTA_energy_40ft,MBTA_energy_60ft,
                                  route_length,avg_speed)), 
                         columns = ["route_id", "trip_count", "MBTA_energy_30ft","MBTA_energy_40ft","MBTA_energy_60ft",
                                    "route_length","avg_speed"])

#storing estiamted data in database 
trip_data.to_sql('mbta_e_data', con=engine, if_exists = 'replace')

5. Creaing a EV library 

This constains the cost data and vehicle information for different size of buses.

In [4]:
#creating a dictionary of required ev values 
cost_lib = {"instal_costs" : 55000, " charger_costs": 50000, "vehicle_ main_d" : .88, "vehicle_main_e" : .64 ,  "battery_replace_cost" : 83 , 
            "charging _onm" : 500, "fuel_infra_costs" : 0.02}
calc_lib = {"num_buses": 80 ,"diesel_bus_cost" : 500000, "num_chargers": 20,  
              "charge_power_dc": 50, "charge_power_l2" : 7.5 , 
             "discount_rate" : 0.025, "lifetime" : 12}
bus_lib = {"empt_wt": {"30ft": 13500, "40ft": 19700, "60ft": 30600},
          "front_area": {"30ft": 7.902, "40ft": 8.78, "60ft": 8.78},
          "battery_size": {"30ft": 215, "40ft": 352, "60ft": 446}}


#creating a cost dataframe and mySQL table for
cost_lib = pd.DataFrame(data = cost_lib, index = [0])
cost_lib.to_sql('cost_library', con=engine, if_exists ="replace")

#creating a calc dataframe and mySQL table 
calc_lib = pd.DataFrame(data = calc_lib, index = [0])
calc_lib.to_sql('calc_library', con=engine, if_exists ="replace")

#creating a bus dataframe and mySQL table 
bus_lib = pd.DataFrame(data = bus_lib )
bus_lib = bus_lib.reset_index()
bus_lib.to_sql('bus_library', con=engine, if_exists ="replace")

In [24]:

cost_lib

,instal_costs,charger_costs,vehicle_ main_d,vehicle_main_e,battery_replace_cost,charging _onm,fuel_infra_costs
0,55000,50000,0.88,0.64,83,500,0.02

## Collecting Health impacts data 

1. Effect Factor 
2. Intake Fractions 
3. VSL

In [74]:
#loading effect factor 

ef = pd.read_excel("effect factor.xlsx", sheet_name='effect factors', skiprows = 1,nrows = 3448, dtype = {"City": str, "mean":np.float64,
                                                                                             "Population": 'Int64'})
ef = ef[["ID", "#","City","Sub-Continent","Population","mean"]]
ef.to_sql('effect_factor', con=engine, if_exists ="replace")

In [77]:
iff.head()

,Country,CountryCode,CityName,RegionCode,iF_ppm,pop_2000,landarea_km2,LPD_pop_m,DR_m2_s,lat,lon,PCDF
0,Afghanistan,AF,Asadabad,SCA,43.7,101600,1.18,93.5,375.0,34.87,71.15,4.0130
1,Afghanistan,AF,Baghlan,SCA,20.3,114200,5.38,49.2,322.0,36.18,68.75,6.5448
2,Afghanistan,AF,Charikar,SCA,27.9,196700,5.35,85.0,399.0,35.02,69.17,4.6866
3,Afghanistan,AF,Fayzabad,SCA,38.7,148500,4.09,73.5,274.0,37.11,70.58,3.7309
4,Afghanistan,AF,Ghardez,SCA,14.4,102500,4.85,46.5,474.0,33.60,69.22,10.1860

In [4]:
#Loading intake fractions 
iff = pd.read_excel("Global_iF_dataset_plus met.xls", sheet_name = "Data")
iff.to_sql('intake_fractions', con=engine, if_exists ="replace")

In [27]:
#creating VSL tables 
vsl = {"Country": ["United States", "Italy"], "VSL USD million 2020" : [6.267,4.303]}

#creating a cost dataframe and mySQL table for
vsl = pd.DataFrame(data = vsl, index = [0,1])
vsl.to_sql('vsl', con=engine, if_exists ="replace")

In [50]:
ef.dtypes

ID               object
#                object
City             object
Sub-Continent    object
Population       object
mean             object
dtype: object

In [28]:
vsl

         Country  VSL USD million 2020
0  United States                 6.267
1          Italy                 4.303

In [21]:
ef.head()

,ID,#,City,Sub-Continent,Population,mean
0,1,2153,Tokyo,Japan & Korean peninsula,34450000,119.663
1,2,3435,New York--Northern New Jersey--Long,USA & Southern Canada,22380000,226.243
2,3,2359,Mexico,Central America+ & Caribbean,18400000,50.1555
3,4,2244,Seoul,Japan & Korean peninsula,17400000,52.1055
4,5,278,Sao Paolo,Brazil+,17100000,114.035

Ignore following

In [24]:
#opening and storing required files from GTFS folder 

with open(req[0], 'r') as agency, open(req[1], 'r') as stops, open(req[2],'r') as routes, open(req[3],'r') as trips, open(req[4],'r') as stop_times :
    [agency_content, stops_content, routes_content, trips_content, stop_times_content] = [agency.read(), stops.read(), routes.read(), trips.read(), stop_times.read()]
    agency.close(), stops.close(), routes.close(), trips.close(), stop_times.close()